docs/timeline.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-04-27 Mon 16:52 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Graduation Game Plan</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Nicholas Knoblauch">
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css" integrity="sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm" crossorigin="anonymous">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Graduation Game Plan</h1>
<p>
I've put down times for when I would like to have certain items finished (<code>DEADLINE</code>). I believe the timeline is aggressive but achievable.
<code>TODO</code> items are highlighted in red, and where there are multiple items in a category, they are prioritized by letter, (with "A" being the highest)
</p>


<div id="outline-container-orgc0fa51a" class="outline-2">
<h2 id="orgc0fa51a">Functional Genetics by Expectation Maximization Project</h2>
<div class="outline-text-2" id="text-orgc0fa51a">
<p>
Plan is for this chapter to consist of a submitted paper (targeting Bioinformatics).
DEADLINE: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-05-13 Wed&gt;</span></span>
</p>
</div>
<div id="outline-container-orgcfc2f0f" class="outline-4">
<h4 id="orgcfc2f0f"><span class="todo TODO">TODO</span> Finish analyses</h4>
<div class="outline-text-4" id="text-orgcfc2f0f">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-05-04 Mon&gt;</span></span></p>
</div>
<ul class="org-ul">
<li><a id="orgabf3c7f"></a><span class="todo TODO">TODO</span> <span class="priority">[A]</span> Run FGEM on genes from new ASD paper<br>
<div class="outline-text-5" id="text-orgabf3c7f">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-05-01 Fri&gt;</span></span></p>
</div>
</li>
<li><a id="orge58b65b"></a><span class="todo TODO">TODO</span> <span class="priority">[B]</span> Make a decision about feature collinearity issue<br>
<div class="outline-text-5" id="text-orge58b65b">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-04-30 Thu&gt;</span></span></p>
<ul class="org-ul">
<li>FGEM currently can't handle collinearity in the gene annotations</li>
<li>Possible solutions (from easiest to hardest):
<ul class="org-ul">
<li>Add a check for collinear features</li>
<li>Fit model via stochastic minibatch gradient descent (would need to come up with a new name because it would no longer be "Functional Genetics by Expectation Maximization")</li>
<li>Prior on \(\beta\)</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org0a7720b" class="outline-4">
<h4 id="org0a7720b"><span class="todo TODO">TODO</span> Finish first draft</h4>
<div class="outline-text-4" id="text-org0a7720b">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-05-08 Fri&gt;</span></span></p>
</div>
</div>
</div>

<div id="outline-container-orge8021f9" class="outline-2">
<h2 id="orge8021f9">Polygenic RSS</h2>
<div class="outline-text-2" id="text-orge8021f9">
<p>
As it stands there will probably more than one paper's worth of work to be written up for this project
by the time it is finished. The current plan is for this project is to get one paper out of the project
and for the rest of the work to go in the dissertation.
</p>
</div>
<div id="outline-container-org0d5839d" class="outline-3">
<h3 id="org0d5839d">Write Paper</h3>
<div class="outline-text-3" id="text-org0d5839d">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-06-05 Fri&gt;</span></span></p>
</div>
<div id="outline-container-org21ae860" class="outline-4">
<h4 id="org21ae860"><span class="todo TODO">TODO</span> Finish analyses</h4>
<div class="outline-text-4" id="text-org21ae860">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-05-04 Mon&gt;</span></span></p>
</div>
<ul class="org-ul">
<li><a id="orgc993135"></a><span class="todo TODO">TODO</span> <span class="priority">[A]</span> Finish up UK-Biobank GWAS Simulations<br>
<div class="outline-text-5" id="text-orgc993135">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-05-22 Fri&gt;</span></span></p>
</div>
<ul class="org-ul">
<li><a id="orgbfab114"></a><span class="todo TODO">TODO</span> <span class="priority">[A]</span> Complete with vs without ldetect/ldshrink single-chromosome simulations<br></li>
</ul>
</li>
<li><a id="orgec855f8"></a><span class="todo TODO">TODO</span> <span class="priority">[B]</span> Finish up UK-biobank/Genbank GWAS real-data analysis<br>
<ul class="org-ul">
<li><a id="orge6c2666"></a><span class="todo TODO">TODO</span> Need to decide if I want to use in-sample LD, or 1000 genomes out-of-sample LD (for apples to apples comparison with LDSC)<br>
<div class="outline-text-6" id="text-orge6c2666">
<p>
Several UKB LDSC results with 1KG LD are already available so it might not be worth the effort of rerunning
</p>
</div>
</li>
</ul>
</li>
<li><a id="org6674b9a"></a><span class="todo TODO">TODO</span> <span class="priority">[B]</span> Figure out what to do about inflated \(\hat{h^2}\) estimate at high \(h^2\)<br>
<div class="outline-text-5" id="text-org6674b9a">
<p>
I have a few hypotheses about what's causing the inflation:
</p>
<ol class="org-ol">
<li>Underestimating local LD due to ldshrink</li>
<li>Underestimating long-range LD due to ldetect blocking</li>
<li>Over-estimating intermediate-range LD due to ldetect blocking</li>
<li>Breakdown of assumptions of RSS likelihood</li>
</ol>
</div>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgc117214" class="outline-2">
<h2 id="orgc117214">Preterm Birth Fine Mapping</h2>
<div class="outline-text-2" id="text-orgc117214">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-06-30 Tue&gt;</span></span></p>
<p>
My plan is to write up the analyses that I've already done (that went in to the first March of Dimes paper) as my third chapter.  Depending on how things go, additional 
analyses that need to be done can go in to another paper or 
</p>
</div>
<div id="outline-container-orge96b8d7" class="outline-3">
<h3 id="orge96b8d7">Finish analyses</h3>
<div class="outline-text-3" id="text-orge96b8d7">
</div>
<div id="outline-container-orgaaf5b20" class="outline-4">
<h4 id="orgaaf5b20"><span class="todo TODO">TODO</span> <span class="priority">[A]</span> Incorporate TCM term vs preterm ATAC annotations into a new model</h4>
</div>
<div id="outline-container-org9d919fc" class="outline-4">
<h4 id="org9d919fc"><span class="todo TODO">TODO</span> <span class="priority">[B]</span> Incorporate TF ChIP-seq annotations into a new model</h4>
</div>
<div id="outline-container-org0c39804" class="outline-4">
<h4 id="org0c39804"><span class="todo TODO">TODO</span> <span class="priority">[A]</span> Compare which loci are implicated by which models</h4>
</div>
</div>
<div id="outline-container-org2e3690f" class="outline-3">
<h3 id="org2e3690f">Write up analyses</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nicholas Knoblauch</p>
<p class="date">Created: 2020-04-27 Mon 16:52</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
